snlkuharlocal/src/Documents/Заказ/Заказ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Заказ</name>
  <basedOn>Document.ПриходнаяНакладная</basedOn>
  <basedOn>Document.Перемещение</basedOn>
  <basedOn>Document.РасходнаяНакладная</basedOn>
  <registerRecords>AccumulationRegister.РезервыТМЦ</registerRecords>
  <registerRecords>AccumulationRegister.ЗаказыКонтрагентов</registerRecords>
  <attributes>
    <name>b2b_Дозаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АдресПерегруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОплаты</name>
    <type>
      <types>EnumRef.ВидыОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВремяПерегруза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГосНомерАМЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Грузополучатель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппыТоваров</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗаказа</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОплаты</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОформления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокОснование</name>
    <type>
      <types>DocumentRef.Заказ</types>
      <types>DocumentRef.ПродажаИМ</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.Перемещение</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСкидкаНаНакладную</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаявкаНаПроизводство</name>
    <type>
      <types>DocumentRef.ЗаявкаНаПроизводство</types>
    </type>
  </attributes>
  <attributes>
    <name>ИБ</name>
    <type>
      <types>CatalogRef.ИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникЗаказа</name>
    <type>
      <types>EnumRef.ИсточникЗаказа</types>
    </type>
  </attributes>
  <attributes>
    <name>КодВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоКоробок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Курс</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>неКонтролироватьДублиСтрок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеСоответствуетЗаявке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВторичногоКонтрагента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НулеваяСтавкаНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемКоробов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>4</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Отгружен</name>
    <type>
      <types>EnumRef.Отгружен</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтсрочкаПлатежа</name>
    <type>
      <types>CatalogRef.ОтсрочкиПлатежа</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоставщикПоАгентскойСхеме</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктДоставки</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>ПунктПерегруза</name>
    <type>
      <types>CatalogRef.ПунктыДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДоставки</name>
    <type>
      <types>CatalogRef.РайоныДоставки</types>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.Регионы</types>
    </type>
  </attributes>
  <attributes>
    <name>Скидка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеНакладной</name>
    <type>
      <types>EnumRef.СостоянияЗаказаКонтрагента</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеСогласования</name>
    <type>
      <types>EnumRef.СостоянияСогласования</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипСкидок</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦенРаспродажа</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ФиоЭкспедитора</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СкладМаркировки</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Единица</name>
      <type>
        <types>CatalogRef.Единицы</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>7</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Всего</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВсегоБезСкидки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <comment>Скидка %</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПодтвержденнаяЗаявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипЦен</name>
      <type>
        <types>CatalogRef.ТипыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаИсточник</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Контрагенты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасходныеНакладные</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>DocumentRef.РасходнаяНакладная</types>
        <types>DocumentRef.Перемещение</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеСклады</name>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеДвижения</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

snlkuharlocal/src/Enums/ИсточникЗаказа/ИсточникЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ИсточникЗаказа</name>
  <enumValues>
    <name>БазаТЦфранчайзинг</name>
  </enumValues>
  <enumValues>
    <name>Сайт</name>
  </enumValues>
  <enumValues>
    <name>РучнойВвод</name>
  </enumValues>
</mdclass:Enum>

snlkuharlocal/src/Documents/Заказ/ObjectModule.bsl
Перем НачСостНакладной;
Перем НеКонтролироватьЗапись;

//////////////////////////////////// СТАНДАРТНЫЕ ///////////////////////////////////////////////////////////////

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)	
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	КонтрольДатыЗапрета(ЭтотОбъект,Отказ);
	
	// Шворобей ВЮ 29.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-769
	//++Данилова Е.В. 18.11.2024
	//Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт И ПометкаУдаления Тогда
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт И ПометкаУдаления 
		И НЕ b2b_ОбменЗаявками.Этоb2bЗаказКлиента(ссылка) Тогда
	//--Данилова Е.В. 18.11.2024
		Отказ = Истина;
	КонецЕсли;
	// Шворобей ВЮ 29.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-769

	Если Отказ Тогда Возврат КонецЕсли; 
	
	//Кухарь А.Ю. 13.06.2024 начало	
	если РежимЗаписи=РежимЗаписиДокумента.Запись и Проведен тогда
		РежимЗаписи=РежимЗаписиДокумента.Проведение;   
	КонецЕсли;
	//Кухарь А.Ю. 13.06.2024 конец
	
	СуммаДокумента		= Товары.Итог("Всего");
	ОбъемДокумента		= Товары.Итог("Объем");
	КоличествоДокумента = Товары.Итог("Количество");
	ГруппыТоваров		= ГруппыТоваровДокумента(ЭтотОбъект);
	
	//крохин начало 08.06.2022
	//надоело просить Диму. Переделать определение склада на регистр сведений
	Если Склад.Пустая() И ИсточникЗаказа = Перечисления.ИсточникЗаказа.БазаТЦфранчайзинг Тогда
		Склад = Справочники.Склады.НайтиПоКоду("STB-01");
		СостояниеНакладной = Перечисления.СостоянияНакладной.ПолученоОфисом;
	КонецЕсли;
	//крохин конец 08.06.2022
	
	// Шворобей ВЮ 30.01.2023 ++
	// 3.	Перед записью дописать, что если заказ с сайта b2b и ТЧ дополнительные склады – пустая, добавлять в эту ТЧ физический склад от склада документа.
	Если ДополнительныеСклады.Количество() = 0 И ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
		// Шворобей ВЮ 14.09.2023 ++
		Если ЗначениеЗаполнено(Склад.ФизическийСклад) Тогда
			НоваяСтрока = ДополнительныеСклады.Добавить();
			НоваяСтрока.Склад = Склад.ФизическийСклад;
		КонецЕсли;
		// Шворобей ВЮ 14.09.2023 ++
		//++Данилова Е.В. 01.04.2025 HELP-3176 
		Если ЗначениеЗаполнено(СкладМаркировки.ФизическийСклад) Тогда
			НоваяСтрока = ДополнительныеСклады.Добавить();
			НоваяСтрока.Склад = СкладМаркировки.ФизическийСклад;
		КонецЕсли; 		
		//--Данилова Е.В. 01.04.2025
	КонецЕсли;
	//++Данилова Е.В. 10.10.2025 HELP-7391 
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда  
		ПроверкаЗаполненияТЧДополнительныеСклады();		
	КонецЕсли;
	//--Данилова Е.В. 10.10.2025
	
	// Шворобей ВЮ 30.01.2023 ++
	//++Данилова Е.В. 07.10.2024
	//УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект);
	Если НЕ b2b_ОбменЗаявками.Этоb2bЗаказКлиента(ссылка) 
		И НЕ (ДополнительныеСвойства.Свойство("Этоb2bЗаказ")
		И ДополнительныеСвойства.Этоb2bЗаказ) Тогда
		
		УстановитьПолучателейИзмененийОбъекта(ЭтотОбъект); 	
		
	КонецЕсли;
	//--Данилова Е.В. 07.10.2024
	
	// Кухарь А.Ю.  19.04.2023 начало
	СтруктураИзменений=ПолучитьСтруктуруИзменений(РежимЗаписи); 
	если СтруктураИзменений.Товары или СтруктураИзменений.проведен тогда
		ДополнительныеДвижения.Очистить();
		ДополнительныеСвойства.Вставить("ФлагМенятьДополнительныеДвижения", Истина);	
	КонецЕсли;
	если СостояниеНакладной=Перечисления.СостоянияЗаказаКонтрагента.ВРаботе и РежимЗаписи<>РежимЗаписиДокумента.ОтменаПроведения тогда
		дата=ТекущаяДата();
	КонецЕсли;

	// Кухарь А.Ю.  19.04.2023 конец
	
		// Кухарь А.Ю. 03.02.2023 начало
	//Странно выглядит, когда пытаешься записать без проведения распроведённый документ, а этого сделать не даёт из-за остатков
	// Если ОбменДанными.Загрузка Тогда
	Если ОбменДанными.Загрузка или РежимЗаписи<>РежимЗаписиДокумента.Проведение Тогда		 
		// Кухарь А.Ю. 03.02.2023 конец
		
		Возврат;
	КонецЕсли;
	
	ФлагДополнительныеДвиженияСформировать = Ложь;
	
	
	
	
	
	// Шворобей ВЮ 31.01.2023 ++
	// ПОСТАВИМ ФЛАЖОК, НАДО ЛИ МЕНЯТЬ ТЧ ДОПОЛНИТЕЛЬНЫЕ ДВИЖЕНИЯ
	Если ДополнительныеДвижения.Количество() > 0 И СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда
		//
		//ТЧ_Товары = Товары.Выгрузить(, "Номенклатура, Количество");
		//ТЧ_ДополнительныеДвижения = ДополнительныеДвижения.Выгрузить(, "Номенклатура, Количество");
		//
		//ТаблицаРазницы = ЗаполнениеДокументов.РазницаТаблицЗначений(ТЧ_Товары, ТЧ_ДополнительныеДвижения, "Номенклатура, Количество");
		//Если ТаблицаРазницы.Количество() > 0 Тогда
		//	ДополнительныеСвойства.Вставить("ФлагМенятьДополнительныеДвижения", Истина);	
		//КонецЕсли;
		
	КонецЕсли;
	// Шворобей ВЮ 31.01.2023 ++
	
	// Шворобей 31.01.2023 ++
	
	// 1.	При Записи документа нужно чтобы анализировалось изменение товаров по каждой строке.
	// 		a.	При уменьшении количества, нужно уменьшать ТЧ ДополнительныеДвижения
	//		b.	При увеличении количества
	//			i.	 Если любого товара не хватает ни на одном складов (склад документа и ТЧ дополнительные склады) , то писать что по строке такой-то нет товара и не  делать больше ничего.
	//			ii.	Если всего товара хватает, то дельту (между было и стало), проверять по остаткам на складах (в 1ю очередь по складу документа, потом по складам из ТЧ), и дополняем ТЧ ДополнительныеДвижения, новым товаром.
	
	Если ДополнительныеДвижения.Количество() > 0 И ДополнительныеСвойства.Свойство("ФлагМенятьДополнительныеДвижения") Тогда
		ФлагДополнительныеДвиженияСформировать = Истина;
	ИначеЕсли ДополнительныеДвижения.Количество() = 0 И ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт
		И СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе Тогда
		ФлагДополнительныеДвиженияСформировать = Истина;
		// Кухарь А.Ю. 21.04.2023 начало
	ИначеЕсли ИсточникЗаказа = Перечисления.ИсточникЗаказа.БазаТЦфранчайзинг тогда
		ФлагДополнительныеДвиженияСформировать = ложь;
		//Саша попросил временно привязаться к имени пользователя.
		если не ПараметрыСеанса.Пользователь.Наименование="АвтообменЦОФР" 
			И СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе 
			И  (СтруктураИзменений.Товары или СтруктураИзменений.проведен или ДополнительныеДвижения.Количество() = 0)  
			тогда
			ФлагДополнительныеДвиженияСформировать = Истина;
		КонецЕсли;		
		// Кухарь А.Ю. 21.04.2023 конец
		
	КонецЕсли;
	
	Если ФлагДополнительныеДвиженияСформировать Тогда
		
		ТаблицаНабораЗаписей = Новый Соответствие;
		
		// Шворобей ВЮ 07.02.2023 ++ Поменял Ссылку на Объект
		//СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатков(Ссылка);
		//ТЧ_Товары = Товары.Выгрузить(, "Номенклатура, Количество");
		//ТЧ_Товары.Колонки.Найти("Количество").Имя = "Нехватка";
		//
		//// Кухарь А.Ю.  19.04.2023 начало
		////Из ссылки старая дата
		//// 		СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары);
		//
		//// Кухарь А.Ю.  02.05.2023 начало
		//// СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары,,Дата);	
		//СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары,,Дата,ложь);	 
		//// Кухарь А.Ю.  02.05.2023 конец
		//
		//// Кухарь А.Ю.  19.04.2023 конец
		//
		//// Шворобей ВЮ 07.02.2023 ++
		//
		//ТаблицаНабораЗаписей.Вставить(Склад, СтруктураВозврата.ТаблицаОстатков);
		//
		//ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
		ДополнительныеДвижения.Очистить();
		//++Данилова Е.В. 01.04.2025
		ТЧ_Товары = Товары.Выгрузить(, "Номенклатура, Количество");
		ТЧ_Товары.Колонки.Найти("Количество").Имя = "Нехватка";
		//++Данилова Е.В. 12.01.2026 SNL-97 
		Если ЗначениеЗаполнено(СкладМаркировки)
			И ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
			МассивСкладов = Новый Массив;
			МассивСкладов.Добавить(СкладМаркировки);
			СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары,МассивСкладов,Дата,ложь);
			ТаблицаНабораЗаписей.Вставить(СкладМаркировки, СтруктураВозврата.ТаблицаОстатков);
		Иначе
			//--Данилова Е.В. 12.01.2026 
			СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары,,Дата,ложь);
			ТаблицаНабораЗаписей.Вставить(Склад, СтруктураВозврата.ТаблицаОстатков);
		КонецЕсли;
		ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
		
		ТОшибок = Неопределено; 
		
		Если ТаблицаНехватки.Количество() > 0  Тогда
			//++Данилова Е.В. 12.01.2026 SNL-97
			ПроверитьДопСклады = Ложь; 
			Если ЗначениеЗаполнено(СкладМаркировки)
				И ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
				МассивСкладов = Новый Массив;
				МассивСкладов.Добавить(Склад);
				
				СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТаблицаНехватки,МассивСкладов,Дата,ложь);
				ТаблицаНабораЗаписей.Вставить(Склад, СтруктураВозврата.ТаблицаОстатков);
				
				ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
			ИначеЕсли  ЗначениеЗаполнено(СкладМаркировки) тогда 
				МассивСкладов = Новый Массив;
				МассивСкладов.Добавить(СкладМаркировки);
				СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТЧ_Товары,МассивСкладов,Дата,ложь);
				ТаблицаНабораЗаписей.Вставить(СкладМаркировки, СтруктураВозврата.ТаблицаОстатков);
				ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
			Иначе
				ПроверитьДопСклады = Истина; 
			КонецЕсли;	
			
	//		МассивСкладов = Новый Массив;
	//		МассивСкладов.Добавить(СкладМаркировки);
	//
	//		СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТаблицаНехватки,МассивСкладов,Дата,ложь);
	//		ТаблицаНабораЗаписей.Вставить(СкладМаркировки, СтруктураВозврата.ТаблицаОстатков);
	//		
	//		ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
			//Если ТаблицаНехватки.Количество() > 0 Тогда
			Если ПроверитьДопСклады 
				ИЛИ ТаблицаНехватки.Количество() > 0 Тогда 				
			//--Данилова Е.В. 12.01.2026 	
				Для Каждого СтрСклад ИЗ ДополнительныеСклады Цикл
					
					МассивСкладов = Новый Массив;
					МассивСкладов.Добавить(СтрСклад.Склад);
					
					СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТаблицаНехватки, МассивСкладов,Дата);			 
					
					ТаблицаНабораЗаписей.Вставить(СтрСклад.Склад, СтруктураВозврата.ТаблицаОстатков);
					
					ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
					
					Если ТаблицаНехватки.Количество() = 0 Тогда
						/////// ОСТАНАВЛИВАЕМ ПРОВЕРКУ /////////////////////////////////////////////////////////
						Прервать;
					КонецЕсли;
					
				КонецЦикла;
				
				Если ТаблицаНехватки.Количество() > 0
					и НЕ b2b_Дозаказ Тогда
					
					Для Каждого Стр ИЗ ТаблицаНехватки Цикл
						СтруктураТовара = Новый Структура("Склад, Номенклатура, Количество", Стр.Склад, Стр.Номенклатура, Стр.Нехватка);
						ЗаписатьВТаблицуОшибок(ТОшибок, ЭтотОбъект,"Недостаточно товара", ТаблицаНехватки.Индекс(Стр), СтруктураТовара, Стр.СвободныйОстаток,0);
					КонецЦикла;
					
				КонецЕсли;

			КонецЕсли;
		
		КонецЕсли;  
		
		
		Если ТОшибок <> Неопределено Тогда
			
			ВывестиТрассировку(ТОшибок, -2);
			Отказ = Истина;
			Возврат; 
		КонецЕсли;		
		 
		//Если ТаблицаНехватки.Количество() = 0 Тогда /// ОСТАТКОВ ХВАТАЕТ НА ОСНОВНОМ СКЛАДЕ, ПРОВОДИМ ПО ДОПОЛНИТЕЛЬНЫМ ДВИЖЕНИЯМ
		//	
		//	Для Каждого ТекСтрока Из СтруктураВозврата.ТаблицаОстатков Цикл
		//		Если ТекСтрока.Количество > 0 Тогда
		//			НоваяСтрока = ДополнительныеДвижения.Добавить();
		//			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
		//			НоваяСтрока.Склад = Склад;
		//		КонецЕсли;
		//	КонецЦикла;
		//	
		//	Возврат;
		//	///////////////////////////////////////////////////////////////////////////////////////////////////
		//Иначе  // ПРОВЕРЯЕМ ПО ДОПОЛНИТЕЛЬНЫМ СКЛАДАМ
		//	
		//	Для Каждого СтрСклад ИЗ ДополнительныеСклады Цикл
		//		
		//		МассивСкладов = Новый Массив;
		//		МассивСкладов.Добавить(СтрСклад.Склад);
		//		
		//		// Кухарь А.Ю.  10.05.2023 начало
		//	  //СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТаблицаНехватки, МассивСкладов);
		//		СтруктураВозврата = Документы.Заказ.ПолучитьСтруктуруОстатковПоТаблицеНехватки(Ссылка, ТаблицаНехватки, МассивСкладов,Дата);			 
		//		// Кухарь А.Ю.  10.05.2023 конец
		//		

		//		
		//		ТаблицаНабораЗаписей.Вставить(СтрСклад.Склад, СтруктураВозврата.ТаблицаОстатков);
		//		
		//		ТаблицаНехватки = СтруктураВозврата.ТаблицаНехватки;
		//		
		//		Если ТаблицаНехватки.Количество() = 0 Тогда
		//			/////// ОСТАНАВЛИВАЕМ ПРОВЕРКУ /////////////////////////////////////////////////////////
		//			Прервать;
		//		КонецЕсли;
		//		
		//	КонецЦикла;
		//	
			////Если ТаблицаНехватки.Количество() > 0 Тогда // НЕ ХВАТАЕТ ТОВАРА И НА ДОПОЛНИТЕЛЬНЫХ СКЛАДАХ
			//	//++ Данилова Е.В. 15.08.2024
			//	Если ТаблицаНехватки.Количество() > 0
			//		 и НЕ b2b_Дозаказ Тогда
			//	//-- Данилова Е.В. 15.08.2024
			//	// Шворобей ВЮ 07.02.2023 ++
			//	ТОшибок = Неопределено;
			//	Для Каждого Стр ИЗ ТаблицаНехватки Цикл
			//		СтруктураТовара = Новый Структура("Склад, Номенклатура, Количество", Стр.Склад, Стр.Номенклатура, Стр.Нехватка);
			//		ЗаписатьВТаблицуОшибок(ТОшибок, ЭтотОбъект,"Недостаточно товара", ТаблицаНехватки.Индекс(Стр), СтруктураТовара, Стр.СвободныйОстаток,0);
			//	КонецЦикла;
			//	ВывестиТрассировку(ТОшибок, -2);
			//	Отказ = Истина; Возврат;
			//	// Шворобей ВЮ 07.02.2023 ++
			//КонецЕсли;
			//
		//--Данилова Е.В. 01.04.2025
			/////////////// ПИШЕМ ТЧ ДОПОЛНИТЕЛЬНЫЕ ДВИЖЕНИЯ ///////////////////////////////////////////////
		
		Для Каждого Элемент ИЗ ТаблицаНабораЗаписей Цикл // ИДЕМ ПО СОХРАНЕННОМУ СООТВЕТСТВИЮ
			
			Для Каждого ТекСтрока ИЗ Элемент.Значение Цикл
				Если ТекСтрока.Количество > 0 Тогда
					НоваяСтрока = ДополнительныеДвижения.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекСтрока);
					НоваяСтрока.Склад = Элемент.Ключ;
				КонецЕсли;
			КонецЦикла;
			
		КонецЦикла;
			
		//КонецЕсли;
		
	КонецЕсли;
	
	// Шворобей 31.01.2023 ++
	
	// + ASU-1173 20241119 Михайловский
	Если НЕ ЗначениеЗаполнено(ИсточникЗаказа) Тогда
		ЭтотОбъект.ИсточникЗаказа = Перечисления.ИсточникЗаказа.РучнойВвод;
	КонецЕсли;
	// - ASU-1173 20241119 Михайловский
	//++Данилова Е.В. 13.12.2024
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
	
		ПроверитьСоответствиеЗаявке(ЭтотОбъект);
	
	КонецЕсли;
	//--Данилова Е.В. 13.12.2024 
	//++Данилова Е.В. 26.08.2025 HELP-6585 
	Если НЕ Отказ  
		И b2b_ОбменЗаявками.Этоb2bЗаказКлиента(Ссылка)  
		И СостояниеНакладной = перечисления.СостоянияЗаказаКонтрагента.ПодтвержденныйЗаказ
		И Ссылка.СостояниеНакладной <> СостояниеНакладной 
		и РежимЗаписи =РежимЗаписиДокумента.Проведение Тогда 
		//отправить команду плановой даты отгрузки 
		b2b_ОбменЗаявками.ОтправитьПлановуюДатуОтгрузкиВФоне(ссылка,ВерсияДанных); 
	КонецЕсли;
	//--Данилова Е.В. 26.08.2025 
	
КонецПроцедуры

//++Данилова Е.В. 10.10.2025 HELP-7391
Процедура ПроверкаЗаполненияТЧДополнительныеСклады()  	
	
	Если СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе
		И НЕ ЗначениеЗаполнено(СкладМаркировки) Тогда
		МассивДляУдаленияСклада = Новый массив; 
		Для каждого СкладДопСтрока Из ДополнительныеСклады Цикл
			
			Если СкладДопСтрока.Склад.ЭтоСкладМаркированногоТовара Тогда
				
				МассивДляУдаленияСклада.Добавить(СкладДопСтрока); 	
				
			КонецЕсли;	
			
		КонецЦикла;	
		
		Для каждого ЭлМассива Из МассивДляУдаленияСклада Цикл
			
			ДополнительныеСклады.Удалить(ЭлМассива); 
			
			СообщитьИзМодуля("Из таблицы дополнительных складов был удален склад маркировки!!Заполните склад маркировки!!!"); 
			
		КонецЦикла;
		
		
	КонецЕсли;
	
	
КонецПроцедуры
//--Данилова Е.В. 10.10.2025
Процедура ОбработкаЗаполнения(Основание)
	Если ТипЗнч(Основание)=Тип("Структура") Тогда Возврат КонецЕсли;
	Если Основание=Неопределено ИЛИ Основание.Пустая() Тогда Возврат КонецЕсли;
	
	ВидОснования	= Основание.Метаданные().Имя;
	
	ВариантЗаполнения=Неопределено;
	#ЕСЛИ КЛИЕНТ ТОГДА
		ВариантЗаполнения=ВыбратьВариантЗаполнения();
	#КОНЕЦЕСЛИ
	
	ДокОснование	= Основание;
	
	ИБ				= Основание.ИБ;
	
	Контрагент 		= ПолучитьРеквизитОбъекта(ДокОснование,"Контрагент");
	Договор			= ПолучитьРеквизитОбъекта(ДокОснование,"Договор");
	ЛевыйКонтрагент = ПолучитьРеквизитОбъекта(ДокОснование,"ЛевыйКонтрагент");
	ПунктДоставки	= ПолучитьРеквизитОбъекта(ДокОснование,"ПунктДоставки");
	Менеджер 		= ПолучитьРеквизитОбъекта(ДокОснование,"Менеджер");
	
	БанковскийСчет	= ПолучитьРеквизитОбъекта(ДокОснование,"БанковскийСчет");		
	ОтсрочкаПлатежа = ПолучитьРеквизитОбъекта(ДокОснование,"ОтсрочкаПлатежа");			
	ВидОплаты		= ПолучитьРеквизитОбъекта(ДокОснование,"ВидОплаты");		
	
	Организация		= ПолучитьРеквизитОбъекта(ДокОснование,"Организация");		
	Если ВидОснования="Перемещение" Тогда
		Склад		= ДокОснование.СкладПолучатель;	
	Иначе		
		Склад		= ПолучитьРеквизитОбъекта(ДокОснование,"Склад");	
	КонецЕсли;	
	//крохин начало 05.03.2011
	//подразделение не копируем 
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение;
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец 05.03.2011
	
	//крохин начало
	//Группы товаров пересчитаем заново
	//ГруппыТоваров	= ПолучитьРеквизитОбъекта(ДокОснование,"ГруппыТоваров");
	//крохин конец
	
	ТипЦен			= ПолучитьРеквизитОбъекта(ДокОснование,"ТипЦен");
	ТипСкидок		= ПолучитьРеквизитОбъекта(ДокОснование,"ТипСкидок");
	Скидка			= ПолучитьРеквизитОбъекта(ДокОснование,"Скидка");	
	
	ТранспортнаяКомпания = ПолучитьРеквизитОбъекта(ДокОснование,"ТранспортнаяКомпания");
	
	Если ВидОснования="ПриходнаяНакладная" И НЕ ПолучитьПолномочиеПользователя("ВидимостьПриходныхЦен") Тогда
		ОбнулитьЦены=Истина;	
	Иначе
		ОбнулитьЦены=Ложь;	
	КонецЕсли;
	
	Комментарий=Комментарий+ДокОснование.Метаданные()+" № " + ДокОснование.Номер + " от " + Формат(ДокОснование.Дата,"ДФ=dd.MM.yy");
	
	Для Каждого исхСтрокаТЧ Из ДокОснование.Товары Цикл
		СтрокаТЧ = Товары.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрокаТЧ,исхСтрокаТЧ);	
		Если ВариантЗаполнения="НехватающиеЗаявка" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.Заявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="НехватающиеПодтверждение" Тогда
			СтрокаТЧ.ПодтвержденнаяЗаявка	=исхСтрокаТЧ.ПодтвержденнаяЗаявка-исхСтрокаТЧ.Количество;
			СтрокаТЧ.Количество				=СтрокаТЧ.ПодтвержденнаяЗаявка;				
			СтрокаТЧ.Заявка					=СтрокаТЧ.ПодтвержденнаяЗаявка;
		ИначеЕсли ВариантЗаполнения="Целиком" Тогда			
			Если СтрокаТЧ.Заявка=0 Тогда
				СтрокаТЧ.Заявка	=СтрокаТЧ.Количество;			
			КонецЕсли;
			Если СтрокаТЧ.ПодтвержденнаяЗаявка=0 Тогда
				СтрокаТЧ.ПодтвержденнаяЗаявка=СтрокаТЧ.Количество;
			КонецЕсли;
			
		КонецЕсли;		
		
		Если ОбнулитьЦены Тогда
			СтрокаТЧ.Цена=0;		
			СтрокаТЧ.ЦенаБезСкидки=0;
		КонецЕсли;
		
		Если СтрокаТЧ.Количество=0 Тогда
			Товары.Удалить(СтрокаТЧ);	
		Иначе
			РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
		КонецЕсли; 
	КонецЦикла;	
	
	//крохин начало
	ГруппыТоваров	=ГруппыТоваровДокумента(ЭтотОбъект);
	Если Дата >= '20101001' Тогда
		СекторХранения = СекторХраненияДокумента(ЭтотОбъект);
	КонецЕсли;
	//крохин конец
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Организация			=Неопределено;
	СостояниеНакладной	=Неопределено;
	Отгружен			=Неопределено;
	СостояниеДокументов	=Неопределено;	
	
	ДатаОтгрузки		=Неопределено;
	ДатаОплаты			=Неопределено;
	ДатаВыгрузки		=Неопределено;
	ДатаОформления		=Неопределено;
	
	Автор				=Неопределено;
	
	// Кельманов А.В. - ASU-1087 - 2024.11.28 {
	КодВторичногоКонтрагента = "";
	НаименованиеВторичногоКонтрагента = "";
	НомерЗаказаВторичногоКонтрагента = "";	
	ИсточникЗаказа = Перечисления.ИсточникЗаказа.РучнойВвод;
	// Кельманов А.В. - ASU-1087 - 2024.11.28 }
	
	Если Менеджер.Пустая() Тогда
		Менеджер=?(ПунктДоставки.Менеджер.Пустая(),Контрагент.Менеджер,ПунктДоставки.Менеджер);
	КонецЕсли;
	//крохин начало
	//++Данилова Е.В. 29.09.2025 HELP-7048
	//Подразделение = Менеджер.Подразделение;
	Подразделение = ЗаполнениеДокументов.ПодразделениеПродажПоМенеджеру(Менеджер);
	//--Данилова Е.В. 29.09.2025
	Если Подразделение = Справочники.Подразделения.ПустаяСсылка() Тогда
		Подразделение = Склад.Подразделение;
	КонецЕсли;
	//крохин конец
	
	Если Договор.Пустая() Или Договор.НеИспользовать Тогда
		Договор=Контрагент.ОсновнойДоговор;			
	КонецЕсли; 
	//крохин начало
	//только предоплата
	Если Контрагент.Ведущий.ТолькоПредоплата Тогда
		ОтсрочкаПлатежа = Справочники.ОтсрочкиПлатежа.НайтиПоКоду("1");	
	КонецЕсли;
	//крохин конец
	
	//крохин начало 15.04.2021
	ЗаявкаНаПроизводство = Неопределено;
	//крохин конец 15.04.2021
	
	// ++ Шворобей ВЮ 14.02.2022
	Контрагенты.Очистить();
	РасходныеНакладные.Очистить();
	ДополнительныеСклады.Очистить();
	ДополнительныеДвижения.Очистить();
	// ++ Шворобей ВЮ 14.02.2022
	
	// Шворобей ВЮ 28.12.2023 ++
	ПоставщикПоАгентскойСхеме = Неопределено;
	ПересчитатьТабличнуюЧасть(Товары);
	// Шворобей ВЮ 28.12.2023 ++
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ДвиженияПоРегистрам = Неопределено;
	РезультатПроведения = ПроведениеПоРегистрамЗаказыКонтрагентов(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);
	ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);
	
	Если НЕ b2b_Дозаказ Тогда
		ДвиженияПоРегистрам = Неопределено;
		РезультатПроведения = ПроведениеПоРегистрамОстатков(Ссылка,ДвиженияПоРегистрам,ОбменДанными.Загрузка);
		ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,ОбменДанными.Загрузка);
	КонецЕсли;
КонецПроцедуры

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////

Функция НакладнаяОтгружена() Экспорт
	
	Возврат (СостояниеНакладной = Перечисления.СостоянияНакладной.Отгружена)
	Или (СостояниеНакладной = Перечисления.СостоянияНакладной.ОтгруженаНаТранзитныйСклад);
	
КонецФункции

Процедура УстановитьСостояниеДокументов(НовоеСостояниеДокументов) Экспорт
	//крохин начало 09.02.2011
	//за датой запрета записываем реквизиты только в ЦО
	//НеКонтролироватьЗапись=Истина;
	//СостояниеДокументов=НовоеСостояниеДокументов;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если	ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение  Тогда
			НеКонтролироватьЗапись=Истина;
			СостояниеДокументов=НовоеСостояниеДокументов;
			Записать();
			НеКонтролироватьЗапись=Ложь;	
		КонецЕсли;
	Иначе
		НеКонтролироватьЗапись=Истина;
		СостояниеДокументов=НовоеСостояниеДокументов;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	//крохин конец 09.02.2011
	
КонецПроцедуры

Процедура УстановитьДатуНомерСчета(НоваяДатасчета,НовыйНомерСчета)   Экспорт
	//крохин начало 09.02.2011
	//за датой запрета записываем реквизиты только в ЦО
	//НеКонтролироватьЗапись=Истина;
	//НомерСчета=НовыйНомерСчета;
	//ДатаСчета= НоваяДатасчета;
	//Записать();
	//НеКонтролироватьЗапись=Ложь;
	Отказ = Ложь;
	Если ЭтотОбъект.Дата<=ПолучитьДатуЗапретаРедактирования(ЭтотОбъект) Тогда
		Отказ = Истина;
	КонецЕсли;
	Если Отказ Тогда
		Если ПараметрыСеанса.ТипУзла = Перечисления.ТипУзлаИБ.УправляющееПодразделение Тогда
			НеКонтролироватьЗапись=Истина;
			НомерСчета=НовыйНомерСчета;
			ДатаСчета= НоваяДатасчета;
			Записать();
			НеКонтролироватьЗапись=Ложь;
		КонецЕсли;	
	Иначе
		НеКонтролироватьЗапись=Истина;
		НомерСчета=НовыйНомерСчета;
		ДатаСчета= НоваяДатасчета;
		Записать();
		НеКонтролироватьЗапись=Ложь;
	КонецЕсли;
	//крохин конец 09.02.2011
КонецПроцедуры

//крохин начало 10.08.2020
Процедура ВыполнитьДвиженияПоРегистрам(ДвиженияПоРегистрам,Записывать=Ложь,Очищать=Истина)
	// 2011-11-21 сезонные бонусы ***
	Для Каждого НаборДвижений Из ДвиженияПоРегистрам Цикл
		ИмяРегистра		=НаборДвижений.Ключ;
		ТаблицаДвижения =НаборДвижений.Значение;
		
		Если Движения.Найти(ИмяРегистра)=Неопределено Тогда Продолжить  КонецЕсли; 
		
		НаборЗаписей=Движения[ИмяРегистра];
		// *** 2011-11-21 сезонные бонусы
		//НаборЗаписей.Очистить();
		// ---------- заменено на:
		Если Очищать Тогда
			НаборЗаписей.Очистить();
		КонецЕсли;
		// 2011-11-21 сезонные бонусы ***
		
		Для Каждого Движение Из ТаблицаДвижения Цикл
			Запись=НаборЗаписей.Добавить();	
			ЗаполнитьЗначенияСвойств(Запись,Движение);	
			
			Запись.Регистратор=Ссылка;
		КонецЦикла;	
		
		Если Записывать Тогда
			НаборЗаписей.Записать();		
		КонецЕсли;
	КонецЦикла;	
КонецПроцедуры 

Процедура УстановитьЗаказ(ЗАП) Экспорт
	Если ЗаявкаНаПроизводство.Пустая() Тогда
		ЗаявкаНаПроизводство = ЗАП;
		СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ЗаказаноПоставщику;
		Записать(?(Проведен,РежимЗаписиДокумента.Проведение,РежимЗаписиДокумента.Запись));
	КонецЕсли;
КонецПроцедуры
//крохин конец 10.08.2020

//нечаева  17,11,21+++
Процедура  ЗаписатьДанныеВРегистрОтправкаЗаказов(ДокСсылка,СостояниеСогласования,ОшибкаЗаписи=неопределено)  Экспорт
	
	//очистим, если есть данные
	//НаборЗаписей = РегистрыСведений.РегистрацияОбменаЗаказамиb2b.СоздатьНаборЗаписей();
	//НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
	//НаборЗаписей.Записать(); 
	
	//запишем
	//Если была смена статуса , то пишем
	
	попытка
		НаборЗаписей = РегистрыСведений.РегистрацияОбменаЗаказамиb2b.СоздатьНаборЗаписей(); 
		НаборЗаписей.Отбор.Документ.Установить(ДокСсылка); 
		
		НоваяЗапись = НаборЗаписей.Добавить(); 
		
		НоваяЗапись.НомерЗаказа = СокрЛП(ДокСсылка.НомерЗаказа);
		НоваяЗапись.датаЗаказа  = ДокСсылка.ДатаЗаказа;
		Новаязапись.Документ = ДокСсылка;
		новаязапись.НужноОтправить = истина;
		новаязапись.дата = ТекущаяДата();
		новаязапись.СтатусОтправки = состояниеСогласования;
		
		НаборЗаписей.Записать(); 
	исключение
		сообщить(ОписаниеОшибки());
        ЗаписатьВЛог("b2b"," Ошибка смены статуса заказа "+ОписаниеОшибки(),,,,);
		ОшибкаЗаписи = истина;
	конецПопытки;
	
	//Если ДокСсылка.Контрагент = Справочники.Контрагенты.НайтиПоКоду("SSP-3180") Тогда
	//	        ЗаписатьВЛог("Гипеглобус",Строка(Докссылка)+" -  записано в регистр отправка электронных докуентов для уведомл об отгрузке ! пользователь-"+параметрысеанса.Пользователь,"Важное");
	
	//конецЕсли;
	
	//
	//
	////тут же Регистрируем записи в обмен  из набора записей в SNL
	//// для филиалов, со складов будет в Цо писаться, обмен по регистру идет только в офис.
	//Если ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.УправляющееПодразделение и ПараметрыСеанса.ЭтотУзел.ТипУзла <> Перечисления.ТипУзлаИБ.Склад 	Тогда
	//	
	//	тзНаборЗаписей = НаборЗаписей.Выгрузить();
	//	НаборЗаписей.Отбор.ВидДокумента.Установить(ВидДокумента); 
	//	НаборЗаписей.Отбор.ВидДокумента.Использование=Истина;
	//	НаборЗаписей.Отбор.Документ.Установить(ДокСсылка);
	//	НаборЗаписей.Отбор.Документ.Использование=Истина;
	//	
	//	НаборЗаписей.Отбор.НомерЗаказа.Установить(номерЗаказа);
	//	НаборЗаписей.Отбор.номерЗаказа.Использование=Истина;
	//	НаборЗаписей.Отбор.датаЗаказа.Установить(ДатаЗаказа);
	//	НаборЗаписей.Отбор.ДатаЗаказа.Использование=Истина;
	//	
	//	НаборЗаписей.Прочитать();
	//	НаборЗаписей.ОбменДанными.Получатели.Добавить(ПланыОбмена.Основной.НайтиПоКоду("SNL"));			  
	//	ПланыОбмена.ЗарегистрироватьИзменения(ПланыОбмена.Основной.НайтиПоКоду("SNL"),НаборЗаписей);
	//	
	//КонецЕсли;	
	////конец регистрации обмена	регистра
	//
КонецПроцедуры
//нечаева 17,1121 ----

Процедура ЗаписатьВТаблицуОшибок(ТО,Объект,ТипОшибки,НомерСтроки,СтруктураТовара = Неопределено,Остаток=0,Резерв=0)
	
	Если ТипЗнч(ТО)<>Тип("ТаблицаЗначений") Тогда
		
		ТО = Новый ТаблицаЗначений;	
		
		ТО.Колонки.Добавить("Объект");		
		ТО.Колонки.Добавить("ТипОшибки");
		ТО.Колонки.Добавить("НомерСтроки");		
		ТО.Колонки.Добавить("Склад");		
		ТО.Колонки.Добавить("Номенклатура");		
		ТО.Колонки.Добавить("Количество");
		ТО.Колонки.Добавить("Остаток");
		ТО.Колонки.Добавить("Резерв");
		ТО.Колонки.Добавить("ВиртуальныйРезерв");		
	КонецЕсли;
	
	СтрокаТО=ТО.Добавить();
	
	СтрокаТО.Объект				=Объект.Ссылка;
	СтрокаТО.ТипОшибки			=ТипОшибки;
	
	Если СтруктураТовара<>Неопределено Тогда
		СтрокаТО.Склад			= СтруктураТовара.Склад;
		СтрокаТО.Номенклатура	= СтруктураТовара.Номенклатура;
		СтрокаТО.Количество		= СтруктураТовара.Количество;	
	КонецЕсли;	
	
	СтрокаТО.Остаток			=Остаток;
	СтрокаТО.Резерв				=Резерв;
	
КонецПроцедуры // ЗаписатьВтаблицуОшибок()



// Кухарь А.Ю.  19.04.2023 начало
//
Функция ПолучитьСтруктуруИзменений (РежимЗаписи)
	СтруктураИзменений=новый Структура("Проведен,СостояниеНакладной,Товары",Ложь,Ложь,Ложь);
	если ЭтоНовый() тогда
		СтруктураИзменений.Проведен=Истина;
		СтруктураИзменений.СостояниеНакладной=Истина;
		СтруктураИзменений.Товары=Истина;
		возврат СтруктураИзменений;
	КонецЕсли;

	
	Запрос=новый запрос;
	запрос.УстановитьПараметр("Ссылка",Ссылка);
	запрос.Текст="ВЫБРАТЬ
	|	Заказ.Проведен КАК Проведен,
	|	Заказ.СостояниеНакладной КАК СостояниеНакладной
	|ИЗ
	|	Документ.Заказ КАК Заказ
	|ГДЕ
	|	Заказ.Ссылка = &Ссылка";
	результат=запрос.Выполнить().Выбрать();
	пока результат.Следующий() цикл	
		если СостояниеНакладной<>результат.СостояниеНакладной тогда
			СтруктураИзменений.СостояниеНакладной=Истина;
		КонецЕсли;
		
		если РежимЗаписи=РежимЗаписиДокумента.Проведение тогда
			ОбъектПроведен=Истина;
		ИначеЕсли РежимЗаписи=РежимЗаписиДокумента.ОтменаПроведения тогда
			ОбъектПроведен=Ложь;
		иначе
			ОбъектПроведен=Проведен	
		КонецЕсли;
		если результат.Проведен <> ОбъектПроведен тогда
			СтруктураИзменений.Проведен =Истина;
		КонецЕсли;
		
		
	КонецЦикла;
	
	
	
	запрос.Текст="ВЫБРАТЬ
	|	ЗаказТовары.Номенклатура КАК Номенклатура,
	|	ЗаказТовары.Количество КАК Количество
	|ИЗ
	|	Документ.Заказ.Товары КАК ЗаказТовары
	|ГДЕ
	|	ЗаказТовары.Ссылка = &Ссылка";
	
	
	
	ТЧ_Товары = Товары.Выгрузить(, "Номенклатура, Количество");
	если ЗаполнениеДокументов.РазницаТаблицЗначений(ТЧ_Товары, запрос.Выполнить().Выгрузить(),"Номенклатура, Количество").количество() > 0 тогда
		СтруктураИзменений.Товары=Истина;
	КонецЕсли;
	
	
	
	возврат СтруктураИзменений;
	
	
	
КонецФункции
// Кухарь А.Ю.  19.04.2023 конец

// Шворобей ВЮ 29.09.2023 ++
Процедура ПередУдалением(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.	
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Шворобей ВЮ 29.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-769
	// была проверка И СостояниеСогласования <> Перечисления.СостоянияСогласования.ОтмененЦО Тогда
	// убираю совсем проверку Состояния Согласования
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт Тогда
		Отказ = Истина;
		#Если Клиент Тогда
			СообщитьИзМодуля("Документ не записан, отмените Заказ кнопкой «Отменить Заказ».");
		#КонецЕсли
	КонецЕсли;
	// Шворобей ВЮ 29.10.2024 https://yougile.collant.ru/team/ab6bad3a05c0/#HELP-769
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт
		//++Данилова Е.В. 23.10.2024
		И ЗначениеЗаполнено(СостояниеСогласования)
		//--Данилова Е.В. 23.10.2024
		//++ Данилова Е.В. 16.08.2024
		И НЕ (b2b_ОбменЗаявками.Этоb2bЗаказКлиента(ссылка) И СостояниеСогласования = Перечисления.СостоянияСогласования.НаСогласованииЦО)
		//-- Данилова Е.В. 16.08.2024
		Тогда
		Отказ = Истина;
		#Если Клиент Тогда
			//СообщитьИзМодуля("Документ не записан, отмените Заказ кнопкой «Отменить Заказ».");
		#КонецЕсли
	КонецЕсли;
	
КонецПроцедуры
// Шворобей ВЮ 29.09.2023 ++

// Шворобей ВЮ 28.12.2023 ++
Процедура ПересчитатьТабличнуюЧасть(ТабЧасть) Экспорт
	Для Каждого СтрокаТЧ ИЗ ТабЧасть Цикл
		ПриИзмененииНоменклатурыТабЧасти(СтрокаТЧ, ЭтотОбъект);
		РассчитатьСуммуТабЧасти(СтрокаТЧ, ЭтотОбъект);
	КонецЦикла;
КонецПроцедуры

// Шворобей ВЮ 11.01.2024 ++
Процедура ПриЗаписи(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	Если ИсточникЗаказа = Перечисления.ИсточникЗаказа.Сайт И СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.ВРаботе
		И (СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененЦО ИЛИ СостояниеСогласования = Перечисления.СостоянияСогласования.ОтмененКонтрагент) Тогда
			СостояниеНакладной = Перечисления.СостоянияЗаказаКонтрагента.Отменен;
	КонецЕсли;
КонецПроцедуры
// Шворобей ВЮ 11.01.2024 ++
